{
    "podcast_details": {
        "podcast_title": "The Late-Round Fantasy Football Podcast",
        "episode_title": "790: Risers and Fallers",
        "episode_image": "https://ssl-static.libsyn.com/p/assets/4/0/6/2/40622036a687cbe627a2322813b393ee/Podcast_art_new.png",
        "episode_transcript": " This is the Late Round Podcast with your host, JJ Zacharisen. What's up everyone, it's JJ Zacharisen and this is episode 790 of the Late Round Fantasy Football Podcast, sponsored by FanDuel. Thanks for tuning in. Things change in fantasy football throughout a summer, even before a regular season game is played. Players get hurt, players hold out, players reportedly play roles that we didn't expect them to play. How we felt about guys back in May and June isn't always the same as how we feel about them in August and into September. And that's what today's episode is all about. It's about highlighting these risers and fathers, or the players who have gone up in my rankings a lot over the last two months and the players who have gone in the opposite direction. I say on the show all the time, we should change our opinions with new information. This is not a game about being first and then sticking with that take forever. It's a game about being accurate. Now before I get into the players for today's show, I want to send another reminder to check out the Late Round Draft Guide. It's got fantasy football strategy, philosophy, players to target players to avoid rankings and tiers and more. It's everything you need to dominate your leagues this year. You can read more about it over on LateRound.com. And then one last thing, I didn't call out Ramandre Stevenson and Breece Hall on today's show despite them being fallers. Because I talked about them on last week's Mailbag episode. But they are fallers for me. They got dinged from the Dalvin Cook and Ezekiel Elliott signings. If you want my take on those players, you can hit pause and listen to the beginning of last week's Mailbag episode. Okay, that's out of the way, let's get to it. It's tough to do a show like this one and not talk about Javontae Williams. Williams entered the offseason with a lot of pessimism surrounding him. We watched J.K. Dobbins suffer through a similar injury last year and he couldn't get right. But Williams definitely looks to be ahead of schedule in comparison. And that's why he's a riser. It's fine to play it a little cautiously if you're not much of a risk taker in fantasy. If you were opting for other players in Williams' range this summer, that's defensible in some formats. But right now, today, you should be adjusting. Not only was he able to play in last week's preseason game for Denver, but he actually looked pretty good. Especially as a receiver. Now, he had a rough drop, but he ended up catching 4 or 5 targets. Which is good news, because Williams has a lot of upside as a receiver. In 3 of 4 games last year, he hit a 14% target share. I think it's also important to remember that Javontae Williams was a very, very good prospect. He was over the 95th percentile in my prospect model. Which tells us that he had a pretty elite profile. And the model looks at production metrics and he split a backfield in college with Michael Carter. So he's been rising up my rankings. I think he has the right risk reward where he goes. Especially if you're getting him more as an RB3 on your team. James Cook is another riser for me. He checks a lot of the boxes that we should be looking for in a breakout running back. He's likely going to see a higher target share than he saw last year. So we can label him as a pass catcher. He's part of an ambiguous backfield given where Damian Harris gets drafted. And there are no Bills running backs getting drafted before James Cook. And being part of a good offense doesn't hurt either. Now Damian Harris has been banged up. But Cook has been seeing some great preseason usage. According to my friend Dwayne McFarlane of FantasyLife, in the Bills last preseason game, Cook saw 86% of the team's first team snaps. 75% of their rush attempts. A 70% route participation. And all of the short yardage snaps. He was essentially a bell cow in that game. And by the way, you should check out FantasyLife for real. I always get asked where to get statistics from. Free statistics in particular. And they have awesome tools that they're building for fantasy managers and they're absolutely free. So go check them out, FantasyLife.com. But yeah, it's the preseason, I get it. James Cook being a bell cow in the preseason doesn't really, really, really matter. But it's just evidence of the other stuff that we know about him. That he's a good player, that he was a fine prospect. Maybe he's a little bit undersized, which is somewhat of a worry. But he's got the potential to be a big value in drafts this season. And he's someone I've ended up drafting a lot here in August. Now I do expect Harris to see more goal line work than James Cook. But even if Cook doesn't see it, it's not like he won't score touchdowns. It's not like he'd just end up as a bust no matter what. If he can capture a 10-11% target share in this offense, which is very possible, he'll be just fine. Now speaking of Damian Harris, I actually think that he's a pretty big faller. Harris has been dealing with a knee injury and that played a role in Cook seeing the usage that he saw in the preseason. But there's been a lot of positive reports about Latavious Murray out of Bills camp and on Monday, Ty Johnson signed with the Bills. That could mean absolutely nothing, but it could also point to Harris maybe not being quite there, who knows. What I do know is that I was low on Harris before all of this happened. This has only enhanced my feelings about him. He's been a pretty one-dimensional back since entering the league, and with James Cook there, Harris was unlikely to see a huge target share in this offense. His upside was goal line work. But if Murray is trending upward and with this knee injury, that may not be there for him either. He's just not someone I've drafted that much this year, which probably sounds familiar because I've never been a Damian Harris drafter in fantasy. I've talked about Rashid Rice as a prospect on the show in the past and how he wasn't really doing it for me. He didn't quite get to the 80th percentile in my prospect model, that's a mark that I want players to hit. And that's because his breakout age was pretty average. He was a 4 year wide out at a non-Power 5 program. And his best season marks weren't even that great within that program. They were good, not great. Because of those reasons, I don't think you need to necessarily invest in Dynasty. But the cost to acquire and redraft, totally different. We have to have an open mind about our evaluations, and those evaluations just being wrong. And an easy way to get some action on Rashid Rice actually being really good is through redraft. He's been getting some first team reps. He's flashed his Yak ability in the preseason. It's not a depth chart that's horribly difficult to climb. My rankings have shown Rice as being someone that I'm higher on than the market throughout the summer, oddly. At least compared to the expert consensus rankings over on Fantasy Pros. But I haven't necessarily called him out as a player to target and redraft. I do think chances are he won't be a league winning player just given the stuff that I look at. But I also think when a player is attached to Patrick Mahomes, and when that player shows a little something in the preseason, including playing with the first team, you should adjust your priors. He's a fine target in redraft. Someone who I've low key dropped in my rankings over the last handful of weeks is Cam Akers. And the simple reason? Kyron Williams. Jordan Roderigue of The Athletic has reported that Williams not only looks great in all phases, but he's also been splitting reps with starter Cam Akers. And my fear with Akers is that Williams ends up playing a pass catching role in the Rams offense. Kyron Williams is someone who got dinged big time in my prospect model because of a poor weight adjusted 40 time. Like a really, really bad one. But he had a best season reception share over 15% at Notre Dame. He can be a satellite back, he can play that role. And on a team like the Rams that could be trailing a good bit this year, I do think there's a scenario where GameScript just doesn't play into Cam Akers' favor. Akers is one of those guys who looks great by projections. I talked about that back in May. But things could go south quick. It's why he's living in the dead zone, and it's why he's not been a player that I've aggressively targeted this summer despite that projection looking good. Deuce Vaughn was one of the toughest prospects for my model to figure out like ever. He has arguably the best production profile in the database, of all running backs dating back to 2011. He was obscenely productive in college. But of course, he's small. He's a tiny running back. He weighed in at just 179 pounds at the combine. His BMI isn't that bad, but weight itself as a metric, that does matter. And then his reported 40 time was also really bad. Pairing that with his small weight gave him an awful speed score. So he was lower than the threshold that I want running backs to hit entering the league. Here's the crazy thing about Deuce Vaughn though. Despite that low speed score, he still had a very high draft capital delta in that model. A speed score under 90 means a player is almost definitely going to have a negative draft capital delta. For those of you who have no idea what I'm talking about right now, draft capital delta is simply a look at how my model views a player versus how the league did, or his draft capital. So a positive score means the model liked him more than where he was drafted. A negative one is then the opposite. Since 2011, there have been over 80 running backs in the prospect model database to have a speed score below 90. So they had a bad weight adjusted 40 time. Only 6 of those 80 plus had a positive draft capital delta. Now players under a 90 speed score, they're not good prospects. When a prospect is good when he's productive in college, he generally has a good speed score too. The best player that we've seen with a sub 90 speed score, probably been Devon Singletary since 2011. Maybe theoretic, he's in there too. But considering those are the players that I'm talking about here, clearly it's not good to be under that mark. I just think that Deuce Vaughn is completely unique. His size, his production, it's unlike anything that we've ever seen. And he's looked really really good in preseason action. Throughout the summer he has not been in my top 200 rankings. But this week when I update those rankings, he will be. I'll be making a draft guide update about this this week, but Sean Tucker man, what a whirlwind. I love Tucker pre-draft, and then he went undrafted due to a diagnosis of a heart condition. And now he's on the Buccaneers. Maybe that has long term effects. I'm not sure, I'm not a doctor, clearly. Doctors don't wear gym shorts in their mom's basement every day. But the cost to acquire Tucker is nothing. You shouldn't worry about the heart condition from a fantasy football perspective. You should worry about it from a human perspective. Hopefully Tucker doesn't actually have to deal with this, that would be awesome. Hopefully this is all behind him. But the risk involved in drafting Tucker is zero, because you're not spending anything to get him. Now you might be listening to that and saying, but JJ you like Rashad White. How can I be drafting Sean Tucker if you like Rashad White so much? And yeah, Rashad White's a target for me this year. But as I've said, I'm not right 100% of the time. The Buccaneers can deploy these running backs in a lot of different ways. And as we know, Rashad White is not a proven commodity. I think he's talented, I think that talent's gonna show out, but that's not a lock. And we know that later round picks can overcome depth charts better when their teammates are in the dead zone and not in the early rounds. And Sean Tucker's a rookie, which is also a plus. Now I explained draft capital delta earlier with Deuce Vaughn, and Tucker's was third highest in this year's draft class, behind Lou Nichols and Evan Hall. His prospect score is not fantastic because he went undrafted, it's in the 47th percentile. But Tucker's the eighth best undrafted running back in my model's history, and one of the backs who's really close to him is James Robinson. Who ended up having an amazing rookie campaign, and likely would have had a solid career if not for an Achilles injury. We should be throwing darts at good players. Had Tucker not had that heart condition, he wouldn't have gone undrafted. So if you miss out on Rashad White, feel free to take a chance on Sean Tucker. At least have his name ready for waivers. The last player I want to get to today, Greg Dolcich. I've been pumping up Dolcich this offseason. If you've been listening since January, February, you know that I like Greg Dolcich. His year one peripherals were great. His target share per game rate was third best from any rookie tight end since 2011, behind only Kyle Pitts and Evan Ingram. Two productive tight ends. I've got a tight end prospect model that's still in beta mode, but in that model, his year two score looked great. That points to good things happening in year two and year three of his NFL career. Everything looked glaringly obvious to me. Greg Dolcich was going to be the go to late round tight end for me this year. But there's a new offense in town, a new coaching staff. Sean Payton got his man, an Adam Troutman from New Orleans. And Troutman is sharing tight end duties with Greg Dolcich. At first, I didn't think this was going to be a big deal. I didn't think that Adam Troutman was that big of a threat. But you could argue very easily that judging strictly by preseason usage, Troutman is a more attractive option, strictly from the preseason. Now I'm not there yet. I'm not going to say to draft Adam Troutman above Greg Dolcich, but I have bumped Dolcich down my rankings a decent bit. And that's sad. But like I said at the top, I don't want to just stay with a take forever when we get new information. I want to help you guys win fantasy football championships. And at this moment, we should be moving Greg Dolcich down our rankings. Now fortunately, the market's doing the exact same thing. And to me, he's still a player that you can target as a result. If his ADP stayed the same, then yeah, you shouldn't be going after Greg Dolcich. But it's not. He's a lot cheaper than he was even a month ago. He went from someone who I thought was an obvious late round target to one who's still a pretty good target, but he has a much scarier floor. That's it for today's show though. Thanks to all of you for listening. If you have subscribed to the Late Round Fantasy Football Podcast, make sure you are by searching for it pretty much anywhere podcasts can be found. And don't forget to follow me on Twitter on X at late round QB. And also if any of you are on Instagram, check out the Late Round Fantasy Football Instagram. It's at late round FF. Thanks for listening everyone. I'll talk to you later in the week with the Mailbag Show. And this week, we have the first episode of Late Round Perspectives. I'll talk to you then."
    },
    "podcast_summary": "[\n  {\n    \"rank\": \"1\",\n    \"highlight\": \"Javontae Williams has risen in rankings after showing promise in preseason games.\"\n  },\n  {\n    \"rank\": \"2\",\n    \"highlight\": \"James Cook is another player who has risen in rankings due to his preseason performance and potential in an ambiguous backfield.\"\n  },\n  {\n    \"rank\": \"3\",\n    \"highlight\": \"Damian Harris is considered a faller due to injury concerns and positive reports about Latavius Murray and Ty Johnson.\"\n  },\n  {\n    \"rank\": \"4\",\n    \"highlight\": \"Rashod Rice has impressed in preseason, showing potential as a sleeper pick in redraft leagues.\"\n  },\n  {\n    \"rank\": \"5\",\n    \"highlight\": \"Cam Akers is falling in rankings due to concerns about Kyron Williams splitting reps and potentially taking on a pass-catching role.\"\n  },\n  {\n    \"rank\": \"6\",\n    \"highlight\": \"Deuce Vaughn, despite concerns about his size and speed score, has impressed in preseason and is now a target in rankings.\"\n  },\n  {\n    \"rank\": \"7\",\n    \"highlight\": \"Sean Tucker, an undrafted rookie running back, is a low-risk high-reward option due to his talent and draft capital delta.\"\n  },\n  {\n    \"rank\": \"8\",\n    \"highlight\": \"Greg Dolcich, previously a go-to late-round tight end option, has dropped in rankings due to sharing duties with Adam Troutman.\"\n  }\n]",
    "podcast_guest": {
        "name": "Javontae Williams",
        "summary": "Andy's poor coding got this wrong, the guest is not really Denver Broncos RB Javontae Williams"
    },
    "podcast_highlights": "[\n  {\n    \"rank\": \"1\",\n    \"highlight\": \"Javontae Williams is a riser in my rankings due to his strong preseason performance.\"\n  },\n  {\n    \"rank\": \"2\",\n    \"highlight\": \"James Cook is another riser for me, with a higher target share and strong preseason usage.\"\n  },\n  {\n    \"rank\": \"3\",\n    \"highlight\": \"Damian Harris is a faller for me due to a knee injury and potential competition from other running backs on the team.\"\n  },\n  {\n    \"rank\": \"4\",\n    \"highlight\": \"Rashad Rice is a player to target in redraft leagues due to his preseason performance and being attached to Patrick Mahomes.\"\n  },\n  {\n    \"rank\": \"5\",\n    \"highlight\": \"Cam Akers has dropped in my rankings due to the emergence of Kyron Williams and potential pass-catching role for Williams.\"\n  },\n  {\n    \"rank\": \"6\",\n    \"highlight\": \"Deuce Vaughn, despite concerns about his size and speed, has looked good in preseason and is worth considering in drafts.\"\n  },\n  {\n    \"rank\": \"7\",\n    \"highlight\": \"Sean Tucker, an undrafted rookie, has potential value and should be considered as a waiver wire pickup.\"\n  },\n  {\n    \"rank\": \"8\",\n    \"highlight\": \"Greg Dolcich's value has decreased due to sharing tight end duties with Adam Troutman in a new offense, but he is still a viable late round target.\"\n  }\n]"
}